<?php

$date = $_GET['country_id'];

if ( $date == 001 ){

    $json_data = '[
           [
              {
                 "group": "Вся РОССИЯ",
                 "city": [
                    {
                       "link": "#",
                       "name": "Москва"
                    },
                    {
                       "link": "#",
                       "name": "Санкт-Петербург"
                    }
                 ]
              },
              {
                 "group": "A",
                 "city": [
                    {
                       "link": "#",
                       "name": "Архангельск"
                    },
                    {
                       "link": "#",
                       "name": "Астрахань"
                    }
                 ]
              },
              {
                 "group": "Б",
                 "city": [
                    {
                       "link": "#",
                       "name": "Белгород"
                    },
                    {
                       "link": "#",
                       "name": "Биробиджан"
                    },
                    {
                       "link": "#",
                       "name": "Благовещенск"
                    },
                    {
                       "link": "#",
                       "name": "Брянск"
                    }
                 ]
              },
              {
                 "group": "В",
                 "city": [
                    {
                       "link": "#",
                       "name": "Великий Новгород"
                    },
                    {
                       "link": "#",
                       "name": "Владимир"
                    },
                    {
                       "link": "#",
                       "name": "Волгоград"
                    },
                    {
                       "link": "#",
                       "name": "Вологда"
                    },
                    {
                       "link": "#",
                       "name": "Воронеж"
                    }
                 ]
              },
              {
              "group": "Е",
              "city": [
                 {
                    "link": "#",
                    "name": "Екатеринбург"
                 }
              ]
           }
           ], [
              {
                 "group": "И",
                 "city": [
                    {
                       "link": "#",
                       "name": "Иваново"
                    },
                    {
                       "link": "#",
                       "name": "Иркутск"
                    }
                 ]
              },
              {
                 "group": "К",
                 "city": [
                    {
                       "link": "#",
                       "name": "Калининград"
                    },
                    {
                       "link": "#",
                       "name": "Калуга"
                    },
                    {
                       "link": "#",
                       "name": "Кемерово"
                    },
                    {
                       "link": "#",
                       "name": "Киров"
                    },
                    {
                       "link": "#",
                       "name": "Кострома"
                    },
                    {
                       "link": "#",
                       "name": "Курган"
                    },
                    {
                       "link": "#",
                       "name": "Курск"
                    }
                 ]
              },
              {
                 "group": "Л",
                 "city": [
                    {
                       "link": "#",
                       "name": "Липецк"
                    }
                 ]
              },
              {
              "group": "М",
              "city": [
                 {
                    "link": "#",
                    "name": "Магадан"
                 },
                 {
                    "link": "#",
                    "name": "Москва"
                 },
                 {
                    "link": "#",
                    "name": "Мурманск"
                 }
              ]
           }
           ], [
              {
                 "group":"Н",
                 "city":[
                    {
                       "link":"#",
                       "name":"Нижний Новгород"
                    },
                    {
                       "link":"#",
                       "name":"Новосибирск"
                    }
                 ]
              },
              {
                 "group":"О",
                 "city":[
                    {
                       "link":"#",
                       "name":"Омск"
                    },
                    {
                       "link":"#",
                       "name":"Орёл"
                    },
                    {
                       "link":"#",
                       "name":"Оренбург"
                    }
                 ]
              },
              {
                 "group":"П",
                 "city":[
                    {
                       "link":"#",
                       "name":"Пенза"
                    },
                    {
                       "link":"#",
                       "name":"Псков"
                    }
                 ]
              },
              {
                 "group":"Р",
                 "city":[
                    {
                       "link":"#",
                       "name":"Ростов-на-Дону"
                    },
                    {
                       "link":"#",
                       "name":"Рязань"
                    }
                 ]
              },
              {
              "group":"С",
              "city":[
                 {
                    "link":"#",
                    "name":"Самара"
                 },
                 {
                    "link":"#",
                    "name":"Саратов"
                 },
                 {
                    "link":"#",
                    "name":"Смоленск"
                 }
              ]
           }
           ], [
              {
                 "group": "Т",
                 "city": [
                    {
                       "link": "#",
                       "name": "Тамбов"
                    },
                    {
                       "link": "#",
                       "name": "Тверь"
                    },
                    {
                       "link": "#",
                       "name": "Томск"
                    },
                    {
                       "link": "#",
                       "name": "Тула"
                    },
                    {
                       "link": "#",
                       "name": "Тюмень"
                    }
                 ]
              },
              {
                 "group": "У",
                 "city": [
                    {
                       "link": "#",
                       "name": "Ульяновск"
                    }
                 ]
              },
              {
                 "group": "Ч",
                 "city": [
                    {
                       "link": "#",
                       "name": "Челябинск"
                    }
                 ]
              },
              {
                 "group": "Ю",
                 "city": [
                    {
                       "link": "#",
                       "name": "Южно-Сахалинск"
                    }
                 ]
              },
              {
              "group": "Я",
              "city": [
                 {
                    "link": "#",
                    "name": "Ярославль"
                 }
              ]
           }
           ]
        ]';

} else if ( $date == 002 ) {

    $json_data = '[
           [
              {
                 "group": "Вся Украина",
                 "city": [
                    {
                       "link": "#",
                       "name": "Киев"
                    },
                    {
                       "link": "#",
                       "name": "Львов"
                    },
                    {
                       "link": "#",
                       "name": "Харьков"
                    }
                 ]
              },
              {
                 "group": "A",
                 "city": [
                    {
                       "link": "#",
                       "name": "Авдеевка"
                    },
                    {
                       "link": "#",
                       "name": "Алупка"
                    },
                    {
                       "link": "#",
                       "name": "Алушта"
                    }
                 ]
              },
              {
                 "group": "Б",
                 "city": [
                    {
                       "link": "#",
                       "name": "Бахмут"
                    },
                    {
                       "link": "#",
                       "name": "Белая Церковь"
                    },
                    {
                       "link": "#",
                       "name": "Бердянск"
                    },
                    {
                       "link": "#",
                       "name": "Бурштын "
                    }
                 ]
              },
              {
                 "group": "В",
                 "city": [
                    {
                       "link": "#",
                       "name": "Верховцево"
                    },
                    {
                       "link": "#",
                       "name": "Винница"
                    },
                    {
                       "link": "#",
                       "name": "Вишнёвое"
                    },
                    {
                       "link": "#",
                       "name": "Вознесенск"
                    },
                    {
                       "link": "#",
                       "name": "Вольногорск"
                    }
                 ]
              },
              {
                 "group": "Е",
                 "city": [
                    {
                       "link": "#",
                       "name": "Евпатория"
                    },
                    {
                       "link": "#",
                       "name": "Енакиево"
                    }
                 ]
              }
           ], [
           {
              "group": "И",
              "city": [
                 {
                    "link": "#",
                    "name": "Ивано-Франковск"
                 },
                 {
                    "link": "#",
                    "name": "Иловайск"
                 }
              ]
           },
           {
              "group": "К",
              "city": [
                 {
                    "link": "#",
                    "name": "Каменец-Подольский"
                 },
                 {
                    "link": "#",
                    "name": "Керчь"
                 },
                 {
                    "link": "#",
                    "name": "Киев"
                 },
                 {
                    "link": "#",
                    "name": "Коломыя"
                 },
                 {
                    "link": "#",
                    "name": "Краматорск"
                 },
                 {
                    "link": "#",
                    "name": "Кривой Рог"
                 },
                 {
                    "link": "#",
                    "name": "Кропивницкий"
                 }
              ]
           },
           {
              "group": "Л",
              "city": [
                 {
                    "link": "#",
                    "name": "Львов"
                 }
              ]
           },
           {
              "group": "М",
              "city": [
                 {
                    "link": "#",
                    "name": "Мариуполь"
                 },
                 {
                    "link": "#",
                    "name": "Миргород"
                 },
                 {
                    "link": "#",
                    "name": "Мукачево"
                 }
              ]
           }
        ], [
           {
              "group":"Н",
              "city":[
                 {
                    "link":"#",
                    "name":"Новый Буг"
                 },
                 {
                    "link":"#",
                    "name":"Новый Роздол"
                 }
              ]
           },
           {
              "group":"О",
              "city":[
                 {
                    "link":"#",
                    "name":"Овруч"
                 },
                 {
                    "link":"#",
                    "name":"Одесса"
                 },
                 {
                    "link":"#",
                    "name":"Очаков"
                 }
              ]
           },
           {
              "group":"П",
              "city":[
                 {
                    "link":"#",
                    "name":"Полтава"
                 },
                 {
                    "link":"#",
                    "name":"Пятихатки"
                 }
              ]
           },
           {
              "group":"Р",
              "city":[
                 {
                    "link":"#",
                    "name":"Рахов"
                 },
                 {
                    "link":"#",
                    "name":"Ровно"
                 }
              ]
           },
           {
              "group":"С",
              "city":[
                 {
                    "link":"#",
                    "name":"Севастополь"
                 },
                 {
                    "link":"#",
                    "name":"Симферополь"
                 },
                 {
                    "link":"#",
                    "name":"Судак"
                 }
              ]
           }
        ], [
           {
              "group": "Т",
              "city": [
                 {
                    "link": "#",
                    "name": "Таврийск"
                 },
                 {
                    "link": "#",
                    "name": "Тлумач"
                 },
                 {
                    "link": "#",
                    "name": "Трускавец"
                 },
                 {
                    "link": "#",
                    "name": "Торез"
                 },
                 {
                    "link": "#",
                    "name": "Тячев"
                 }
              ]
           },
           {
              "group": "У",
              "city": [
                 {
                    "link": "#",
                    "name": "Ужгород"
                 }
              ]
           },
           {
              "group": "Ч",
              "city": [
                 {
                    "link": "#",
                    "name": "Чернобыль"
                 }
              ]
           },
           {
              "group": "Ю",
              "city": [
                 {
                    "link": "#",
                    "name": "Южноукраинск"
                 }
              ]
           },
           {
              "group": "Я",
              "city": [
                 {
                    "link": "#",
                    "name": "Ялта"
                 }
              ]
           }
        ]
        ]';

} else if ( $date == 003 ) {

    $json_data = '[
           [
              {
                 "group": "Вся Беларусь",
                 "city": [
                    {
                       "link": "#",
                       "name": "Минск"
                    }
                 ]
              }
            ]
        ]';

} else if ( $date == 004 ) {

    $json_data = '[
           [
              {
                 "group": "Весь Казахстан",
                 "city": [
                    {
                       "link": "#",
                       "name": "Алматы"
                    }
                 ]
              }
            ]
       ]';

};
echo $json_data;
exit;

?>