<?php

    echo "<section class=\"widget-popup\" style=\"opacity:0;visibility:hidden\">

        <a href=\"#\" class=\"widget-popup__close\"></a>

        <div class=\"widget-popup__content\">

            <h2>ПОДВИГИ <span>ПЕРВОЙ МИРОВОЙ</span></h2>

            <div class=\"widget-popup__pic\">
                <img src=\"pic/pic-006.jpg\" alt=\"img\"/>

                <p>http://look3.ru/art/220-nikolay-gastello-mif-i-real-nost</p>

            </div>

            <h3>Героическая атака мертвецов</h3>

            <dl>
                <dt>Дата:</dt>
                <dd>06.08.1915</dd>
            </dl>

            <dl>
                <dt>Место:</dt>
                <dd>Осовец</dd>
            </dl>

            <p>По большому счету крепостям в годы Первой мировой войны не повезло. Если на протяжении
                многих лет они считались главными узлами многокилометровых линий обороны и в связи с
                этим получали необходимое финансирование на проведение модернизации, то в годы Великой
                войны 1914–1918 годов они столкнулись с большими проблемами. И не только в России.
                Довольно скоро выяснилось, что полевые войска могут обходить крепости, блокируя их
                сильные гарнизоны — иногда соответствовавшие по численности небольшой армии — и
                превращая неприступные цитадели в огромные каменные ловушки. В большинстве случаев
                стоявшие во главе армии генштабисты энтузиастами крепостной войны не были и потому в
                конце концов нашли, с их точки зрения, наиболее эффективный способ избежать
                капитуляций сильных крепостных гарнизонов — просто оставлять крепости на произвол
                судьбы при отходе полевой армии, взрывая все их укрепления и оставляя неприятелю груду
                руин. Но за этими сухими строками, описывающими закат «эры крепостей». В большинстве
                случаев стоявшие во главе армии генштабисты энтузиастами крепостной войны не были и
                потому в </p>
        </div>

        <div class=\"widget-popup__footer\">
            <a href=\"#\" class=\"widget-popup__btn\">Мне нужна помощь</a>
            <a href=\"#\" class=\"widget-popup__btn\">Мне нужна помощь</a>
            <a href=\"#\" class=\"widget-popup__btn\">Мне нужна помощь</a>
            <a href=\"#\" class=\"widget-popup__btn\">Мне нужна помощь</a>
        </div>

    </section>";

?>